Repository: msdx/gradle-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: A module dependency has an API which allows for further configuration.
zh_cn: 模块依赖有一个 API，用于进行进一步的配置。

source: A module's status and status scheme are taken into consideration when a latest version selector is resolved.
zh_cn: 一个模块的状态以及状态模式，会在解析 latest 版本选择器时考虑到。

source: A multi-project build is a build where you build more than one project during a single execution of Gradle.
zh_cn: 多项目构建是指在一次Gradle执行中，构建多个项目。

source: A multiproject build must have a settings.gradle file in the root project of the multiproject hierarchy.
zh_cn: 一个多项目的构建，必须在这个多项目的层次结构中的根目录下有一个settings.gradle 文件。

source: A native binary project defines a set of Executable and Library components, each of which Gradle maps to a number of NativeBinary outputs.
zh_cn: 一个原生二进制project定义了一组Executable和Library组件，每一个的 Gradle 都映射大量的NativeBinary输出。

source: A native binary project will contain one or more named FunctionalSourceSet instances (eg 'main', 'test', etc), each of which can contain LanguageSourceSets containing C++, C, Assembler, Objective-C or Objective-C++ source files.
zh_cn: 一个原生二进制project 将包含一个或多个叫做FunctionalSourceSet的实例（如"main"，"test"等），其中每一个都可以包含含有C++，C，Assembler，Objective-C或Objective-C++源代码的LanguageSourceSets。

source: A one element set with the project the plugin was applied to.
zh_cn: 一个元素集合，用于保存将要应用该插件的project

source: A plugin is simply any class that implements the Plugin interface.
zh_cn: 一个插件是任何实现了 Plugin 接口的简单的类。

source: A pre-configured repository that looks for dependencies in Bintray's JCenter.
zh_cn: 一个会在 Bintray 的 Jcenter 查找依赖的预配置仓库。

source: A pre-configured repository that looks for dependencies in Maven Central.
zh_cn: 一个会在 Maven 中央仓中查找依赖的预配置仓库。

source: A pre-configured repository that looks for dependencies in the local Maven repository.
zh_cn: 一个会在本地 Maven 仓库中查找依赖的预配置仓库。

source: A project can have as many as JAR archives as you want.
zh_cn: 一个项目可以有你所想要的一样多的 JAR 文件。

source: A project can publish as many artifacts as it wants.
zh_cn: 一个项目可以发布为它想要的所有构件。

source: A project has a path which denotes the position of the project in the multi-project build tree.
zh_cn: 一个项目有一个路径，表示在多项目构建树中的位置。

source: A project path has the following pattern: It starts always with a colon, which denotes the root project.
zh_cn: 一个项目路径有以下模式︰它总是始于一个冒号，表示根项目。

source: A project's configurations are managed by a configurations object.
zh_cn: 一个项目的配置被一个 configurations 对象所管理。

source: A proper build system has to be designed to be flexible, and Gradle can handle any situation.
zh_cn: 一个正确的构建系统必须被设计得很灵活，而 Gradle 可以应付任何情况。

source: A repository is identified by its URL, type and layout.
zh_cn: 一个仓库由它的 URL、类型和布局来区分。

source: A set of sources may depend on header files provided by another binary component within the same project.
zh_cn: 一组源文件可能依赖于在同一个项目中由另一个二进制组件提供的头文件。

source: A shortcut task definition
zh_cn: 快速任务定义

source: A similar mechanism exists for selecting TargetedNativeComponent.targetBuildTypes() and TargetedNativeComponent.targetFlavors().
zh_cn: 在选择 TargetedNativeComponent.targetBuildTypes() and和TargetedNativeComponent.targetFlavors()上也有类似的机制。

source: A simple option for logging in your build file is to write messages to standard output.
zh_cn: 在构建文件中打印日志的一个简单方法是把消息写到标准输出中。

source: A simple repository on the local filesystem.
zh_cn: 一个在本地文件系统上的简单的仓库。

source: A single build may utilize different tool chains to build variants for different platforms.
zh_cn: 一个构建可以使用不同的工具链来构建不同平台的变种。

source: A source set has an associated compile classpath, and runtime classpath.
zh_cn: 一个源集有一个相关联的编译类路径和运行时类路径。

source: A source set is simply a group of source files which are compiled and executed together.
zh_cn: 一个源集只是一组用于编译并一起执行的源文件。

source: A task parameter will override any corresponding value set in the build script.
zh_cn: 任务参数将覆盖任何在构建脚本中设置的相应值。

source: A task that aggregates the results of all tasks of a particular type: eg.
zh_cn: 一个任务聚合了某一特定类型的所有任务的结果：如，

source: A task with no defined outputs will never be considered up-to-date.
zh_cn: 一个没有定义输出的任务将永远不会被当作是最新的。

source: A task with only outputs defined will be considered up-to-date if those outputs are unchanged since the previous build.
zh_cn: 一个只定义了输出的任务，如果自上一次构建以来它的输出没有改变，那么它会被判定为最新状态。

source: A typical base line configuration includes connection settings for the Sonar server and database.
zh_cn: 一个典型的基线配置包括了Sonar 服务器和数据库的连接设置。

source: A very common way for projects to be coupled is by using configuration injection (Section 56.1, “Cross project configuration”).
zh_cn: 使项目之间耦合的一种很常的方式是使用配置注入（第56.1节， “跨项目配置”）。

source: A very nice and expressive way to provide such tasks are task rules:
zh_cn: 任务规则是提供此类任务的一个很好的表达方式：

source: ANTLR grammar files for the given source set.
zh_cn: 对于给定的source set 的 ANTLR 语法文件。

source: API
zh_cn: 17.4. API

source: About this user guide
zh_cn: 关于本用户指南

source: Above copying the starting scripts to the bin dir and necessary jars to lib in the distribution, all of the files from the src/dist directory are also copied.
zh_cn: 以上在 distribution 中将启动脚本复制到bin目录，并且将必要的 jar 文件复制到lib目录，所有在src/dist目录的文件也会被复制。

source: Accessing the web via a proxy
zh_cn: 通过代理访问网站

source: Add dependency configurations to the project (see Section 8.3, “Dependency configurations”).
zh_cn: 向项目中添加依赖配置 （见第 8.3 节，“依赖配置”）。

source: Add new properties and methods to existing type via extensions.
zh_cn: 通过扩展对现有类型添加新的属性和方法。

source: Add tasks to the favorites (see Favorites tab)
zh_cn: 将任务添加到收藏夹（见收藏夹（Favourites）选项卡）

source: Add tasks to the project (e.g. compile, test)
zh_cn: 将任务添加到项目 （如编译、 测试）

source: Add your own new language elements or enhance the existing ones.
zh_cn: 你可以添加新的语言元素，或增强现有的。

source: Added a new domain object type: SourceSet
zh_cn: 添加了一个新的域对象类型： SourceSet

source: Adding a JAR containing the classes of a source set:
zh_cn: 添加一个包含了源集的类的JAR包

source: Adding a description to a task
zh_cn: 向任务中添加描述

source: Adding a test suite to run the tests in a source set:
zh_cn: 添加一个测试套件以运行一个源集里的测试

source: Adding dependencies to a task
zh_cn: 向任务添加依赖

source: Adding the -a option will cause Gradle to use cached jars to resolve any project lib dependencies and not try to re-build the depended on projects.
zh_cn: 添加-a选项会导致 Gradle 使用缓存的jar 来解决任何项目库依赖，并且不会尝试重新生构建所依赖的项目。

source: Additional dependencies for compiling tests.
zh_cn: 用于编译测试的其他依赖

source: Additional dependencies for running tests only.
zh_cn: 只用于运行测试的其他依赖

source: Additional source sets can be added as needed.
zh_cn: 根据需要，可以添加额外的 source sets。

source: Additionally Gradle provides various convenience method to add pre-configured repositories.
zh_cn: 另外，Gradle 提供了各种方便的方法来添加预配置的仓库。

source: Additionally, a property named purpose is added to each source set by setting ext.purpose to null (null is a permissible value).
zh_cn: 此外，通过将ext.purpose设置为null（null是一个允许的值），一个名为purpose的属性被添加到每个源码集（source set）。

source: Adds C source compilation capabilities to a project.
zh_cn: 向项目添加 C语言源代码编译功能。

source: Adds C++ source compilation capabilities to a project.
zh_cn: 向项目添加 c++ 源代码编译功能。

source: Adds Groovy configuration to .project file.
zh_cn: 将 Groovy 配置添加到.project。

source: Adds Java compilation, testing and bundling capabilities to a project.
zh_cn: 向一个项目添加 Java 编译、 测试和捆绑的能力。

source: Adds Java configuration to .project.
zh_cn: 将 Java 配置添加到.project。

source: Adds Java configuration to the module and project files.
zh_cn: 将 Java 配置添加到模块和项目文件。

source: Adds Objective-C source compilation capabilities to a project.
zh_cn: 向项目中添加 Objective-C 源代码编译功能。

source: Adds Objective-C++ source compilation capabilities to a project.
zh_cn: 向项目中添加 Objective-C++ 源代码编译功能。

source: Adds Scala support to .project and .classpath files.
zh_cn: 添加 Scala 支持到.project和.classpath文件。

source: Adds a Wrapper task for generating Gradle wrapper files.
zh_cn: 添加一个用于生成 Gradle wrapper 文件的Wrapper任务。

source: Adds all .java files found in the Groovy source directories.
zh_cn: 添加在 Groovy 源目录中找到的所有.java文件。

source: Adds all .java files found in the Scala source directories.
zh_cn: 添加在 Scala 源目录中找到的所有.java文件。

source: Adds all source files found in the Groovy source directories.
zh_cn: 添加在 Groovy 的源目录中找到的所有源文件。

source: Adds all source files found in the Scala source directories.
zh_cn: 添加在 Scala 的源目录中找到的所有源文件。

source: Adds ear application support to .project file.
zh_cn: 将 ear 应用程序支持添加到.project文件。

source: Adds integration with Visual Studio.
zh_cn: 添加对 Visual Studio 的集成。

source: Adds native assembly language capabilities to a project.
zh_cn: 向项目添加本机汇编语言的功能。

source: Adds some shared convention properties to the project, relating to report generation.
zh_cn: 将一些共享的公约属性添加到项目中，它们与报告的生成有关。

source: Adds support for assembling web application WAR files.
zh_cn: 添加用于组装 web 应用程序的 WAR 文件的支持。

source: Adds support for building Groovy projects.
zh_cn: 添加对 Groovy 项目构建的支持。

source: Adds support for building J2EE applications.
zh_cn: 添加用于构建 J2EE 应用程序的支持。

source: Adds support for building OSGi bundles.
zh_cn: 添加构建 OSGi 捆绑包的支持。

source: Adds support for building Scala projects.
zh_cn: 添加对 Scala 项目构建的支持。

source: Adds support for building ZIP and TAR distributions for a Java library.
zh_cn: 添加构建一个Java类库的 ZIP 和 TAR 分发包的支持。

source: Adds support for building ZIP and TAR distributions.
zh_cn: 添加构建 ZIP 和 TAR 分发包的支持。

source: Adds support for generating parsers using Antlr.
zh_cn: 添加对使用Antlr作为生成解析器的支持。

source: Adds support for including Windows resources in native binaries.
zh_cn: 添加对在本地bin文件中包含 Windows 资源的支持。

source: Adds support for initializing a new Gradle build.
zh_cn: 添加用于初始化一个新 Gradle 构建的支持。

source: Adds support for publishing artifacts to Maven repositories.
zh_cn: 添加用于将项目发布到 Maven 仓库的支持。

source: Adds support for running CUnit tests.
zh_cn: 添加用于运行CUnit测试的支持。

source: Adds tasks for running and bundling a Java project as a command-line application.
zh_cn: 添加了一些任务，用于运行和捆绑一个Java项目作为命令行应用程序。

source: Adds the Groovy source sets concept to the project.
zh_cn: 向项目中添加Groovy 的源集概念。

source: Adds the Scala source sets concept to the project.
zh_cn: 向项目中添加Scala 的源集概念。

source: Adds the ability to digitally sign built files and artifacts.
zh_cn: 添加对生成的文件或构件进行数字签名的功能。

source: Adds the source sets concept to the project.
zh_cn: 对项目添加源集的概念。

source: Adds the standard lifecycle tasks and configures reasonable defaults for the archive tasks:
zh_cn: 添加标准的生命周期任务，并为归档任务默认进行合理的配置：

source: Adds web application support to .project file.
zh_cn: 将 web 应用程序支持添加到.project文件。

source: Adjusts java compiler settings
zh_cn: 调整 java 编译器设置

source: After all Gradle is a general purpose build tool at its core, so the projects don't have to be java projects.
zh_cn: 在全部 Gradle 的核心都是作为一个通用构建工具后，我们的项目并不一定得是个 java 项目。

source: After importing to eclipse your war/ear projects should be configured to work with WTP.
zh_cn: 你的war/ear项目在导入eclipse 后，应配置为能在 WTP 中使用。

source: After the sonarProperties block has been evaluated, values are converted to Strings as follows: Collection values are (recursively) converted to comma-separated Strings, and all other values are converted by calling their toString() method.
zh_cn: SonarProperties 块在经过评估后，这些值值被转换为字符串，如下所示： 集合的值（递归） 转换为以逗号分隔的字符串，其他所有的值通过调用其tostring ()方法进行转换。

source: Again, this method accepts any of the types supported by the files() method.
zh_cn: 再者，这个方法接受files()方法所支持的任何类型的参数。

source: All .java files of this source set.
zh_cn: 该源集的所有.java 文件。

source: All Checkstyle tasks, including checkstyleMain and checkstyleTest.
zh_cn: 所有 Checkstyle tasks，包括checkstyleMain和checkstyleTest。

source: All CodeNarc tasks, including codenarcMain and codenarcTest.
zh_cn: 所有的 CodeNarc 任务，包括codenarcMain和codenarcTest。

source: All FindBugs tasks, including findbugsMain and findbugsTest.
zh_cn: 所有 FindBugs 任务，包括findbugsMain和findbugsTest。

source: All Groovy source files of this source set.
zh_cn: 该source set 中的所有 Groovy 源文件。

source: All JDepend tasks, including jdependMain and jdependTest.
zh_cn: 所有 JDepend 任务，包括jdependMain和jdependTest。

source: All PMD tasks, including pmdMain and pmdTest.
zh_cn: 所有的 PMD 任务，包括pmdMain和pmdTest。

source: All Scala source files of this source set.
zh_cn: 该source set 中的所有 Scala 源文件。

source: All archive tasks in the project, including jar.
zh_cn: 项目中的所有归档项目，包括jar任务。

source: All attributes for a dependency are optional, except the name.
zh_cn: 一个依赖的所有属性都是可选的，除了 name。

source: All build setup types include the setup of the Gradle Wrapper.
zh_cn: 所有构建安装类型都包括 Gradle Wrapper 的安装。

source: All dependencies in the deploy configuration are placed in the root of the EAR archive, and are not transitive.
zh_cn: 所有在deploy配置中的依赖项都放在 EAR 文件的根目录中，并且是不可传递的。

source: All dependencies in the earlib configuration are placed in the 'lib' directory in the EAR archive and are transitive.
zh_cn: 所有在 earlib 配置的依赖都放在 EAR 文件的“lib”目录中，并且是 可 传递的。

source: All enhanced objects in Gradle's domain model can hold extra user-defined properties.
zh_cn: Gradle 的域模型中，所有增强的对象都可以容纳用户定义的额外的属性。

source: All files stored in src/dist will be added to the root of the distribution.
zh_cn: 所有存储在 src/dist 的文件都将添加到 distribution 的根目录中

source: All in all, your build is less maintainable and reliable than it could be when using client modules.
zh_cn: 总之，比起使用客户端模块，你的构建不再那么容易维护和可靠。

source: All matching task names of the project hierarchy starting with the current dir are executed.
zh_cn: 从当前目录开始的该项目层级里，所有名称匹配的任务会被执行。

source: All of Gradle's scripting features can be leveraged to configure Sonar Runner as needed.
zh_cn: 根据需要，可以利用 Gradle 脚本的所有特性去配置 Sonar Runner。

source: All of Gradle's tasks share a common API and you can create dependencies between them.
zh_cn: Gradle 的所有任务共享一个公共 API，您可以创建它们之间的依赖性。

source: All of the Gradle build language is available in the external script.
zh_cn: Gradle 构建语言的所有内容在外部脚本中也可以使用。

source: All of the artifacts for the module are then requested from the same repository that was chosen in the process above.
zh_cn: 然后这个模块的所有artifact将从上面的过程所选择的 同一个仓库 中请求。

source: All of the files from the src/dist directory are copied.
zh_cn: 所有在src/dist目录中的文件都会被复制。

source: All of the files in the "src/$distribution.name/dist" directory will automatically be included in the distribution.
zh_cn: 所有在”src/$distribution.name/dist“目录中的文件都会被自动地包含在 distribution 中。

source: All of the useful features, such as the ability to compile Java code for example, are added by plugins.
zh_cn: 所有有用的功能，例如以能够编译 Java 代码为例，都是通过插件进行添加的。

source: All of this happened during the apply plugin: "java" step.
zh_cn: 所有这一切都发生在apply plugin: "java"这一步过程中。

source: All source files of this source set.
zh_cn: 该源集的所有源文件。

source: All tasks that build the associated archives.
zh_cn: 所有构建相关archives的任务。

source: All tasks which produce the compile classpath.
zh_cn: 产生编译类路径中的所有任务。

source: All tasks which produce the source set's compile classpath.
zh_cn: 所有产生源集编译类路径的任务。

source: All the hello tasks of the different projects were executed.
zh_cn: 不同项目的所有hello任务被都会被执行。

source: All the Groovy source directories can contain Groovy and Java code.
zh_cn: 所有 Groovy 的源目录都可以包含 Groovy和Java 代码。

source: All the Scala source directories can contain Scala and Java code.
zh_cn: 所有 Scala 的源目录都可以包含 Scala和Java 代码。

source: All the build logic is in the build.gradle of the root project.
zh_cn: 所有的构建逻辑都在根项目的build.gradle中。

source: All the dependencies of the runtime [13] configuration are copied to WEB-INF/lib.
zh_cn: 所有runtime [13]配置的依赖被复制到WEB-INF/lib。

source: All the elements of this tree are Java beans.
zh_cn: 这个配置树的所有元素都是 Java beans。

source: All this is not really a big deal but in its sum it has an impact.
zh_cn: 尽管这一切真的不是大问题，但累加起来就有影响了。

source: All verification tasks in the project, including test.
zh_cn: 项目中的所有核查项目，包括test任务。

source: Allow tests to be declared with javadoc-style annotations.
zh_cn: 允许测试声明为 javadoc 风格的注解。

source: Allows configuring classpath information
zh_cn: 允许配置类路径信息

source: Allows configuring jdt information (source/target java compatibility)
zh_cn: 允许配置 jdt 信息 (source/target java 兼容性)

source: Allows configuring module information
zh_cn: 允许配置模块信息

source: Allows configuring project information
zh_cn: 允许配置项目信息

source: Allows configuring the workspace XML
zh_cn: 允许配置工作区 XML

source: Allows configuring wtp component information only if eclipse-wtp plugin was applied.
zh_cn: 仅当eclipse-wtp插件被应用时，允许配置 wtp 组件信息。

source: Allows configuring wtp facet information only if eclipse-wtp plugin was applied.
zh_cn: 仅当eclipse-wtp插件被应用时，允许配置 wtp 方面信息。

source: Also generates an IDEA project and workspace file if the project is the root project.
zh_cn: 如果该项目为根项目，同时生成一个 IDEA 项目和工作区文件。

source: Also have a look at Ear.
zh_cn: 另请参阅 Ear。

source: Alternatively you can specify the fully qualified task name to be executed.
zh_cn: 或者你可以指定要执行的任务的完整限定名称。

source: Alternatively, Sonar properties can be set from the command line.
zh_cn: 或者，可以从命令行设置 Sonar 属性。

source: Alternatively, a library dependency can be provided directly to the ExecutableBinary for the executable.
zh_cn: 另外，一个库依赖项可以直接提供给ExecutableBinary的executable。

source: Alternatively, an ext block can be used to add multiple properties at once.
zh_cn: 或者，可以使用ext块同时添加多个属性。

source: Alternatively, some or all connection settings can be set from the command line (see Section 35.6, “Configuring Sonar Settings from the Command Line”).
zh_cn: 或者，可以从命令行设置某些或全部的连接设置 （见第 35.6 节，“从命令行配置 Sonar 设置”）。

source: Alternatively, sometimes the module you request can change over time, even for the same version.
zh_cn: 另外，你请求的模块随着时间推移，即使是同一版本，有时也可能改变了。

source: Alternatively, the beforeMerged hook makes it possible to overwrite just certain parts of the existing content.
zh_cn: 另外， beforeMerged hook 可以实现只覆盖现有的某些部分的内容。

source: Alternatively, the properties can be specified in a gradle.properties file, either in the build's root directory or in the Gradle home directory.
zh_cn: 或者，可以在构建的根目录或 Gradle 主目录中的 gradle.properties 文件中指定这些属性。

source: Alternatively, you can configure the tool chains directly, as described in the `Native Binary Variants` section, below.
zh_cn: 或者，你可以直接配置工具链，就如下面的“原生二进制变种”中描述的。

source: Although Gradle already offers parallel test execution via Test.setMaxParallelForks() the feature described in this section is parallel execution at a project level.
zh_cn: 虽然 Gradle 已经通过Test.setMaxParallelForks()提供了并行执行，本节所描述的这个功能是在项目级别上的并行执行。

source: Although Groovy's XML support makes up for a lot, this approach is less convenient than manipulating the domain objects.
zh_cn: 尽管 Groovy 的 XML 支持对其有很大作用，但这种方法比起操纵域对象依然不大方便 。

source: Although module meta-data and module artifacts must be located in the same repository, it is possible to compose a single repository of multiple URLs, giving multiple locations to search for meta-data files and jar files.
zh_cn: 虽然模块的元数据和模块 artifacts 必须位于同一仓库，但也有可能单个仓库有多个 Url，给多个位置去搜索元数据文件和 jar 文件。

source: Amongst other things, Gradle supports the same builder syntax as polyglot Maven.
zh_cn: 除其他事项外，Gradle支持和polyglot Maven同样的生成器语法。

source: An AntBuilder instance
zh_cn: AntBuilder实例

source: An HTML test report.
zh_cn: 一个 HTML 测试报告。

source: An Ivy repository.
zh_cn: 一个 Ivy 仓库

source: An artifact only notation creates a module dependency which downloads only the artifact file with the specified extension.
zh_cn: 一个 artifact only notation 创建了一个模块依赖，它只下载指定扩展名的 artifact 文件。

source: An example of component flavors might differentiate between 'demo', 'paid' and 'enterprise' editions of the component, where the same set of sources is used to produce binaries with different functions.
zh_cn: 一个关于组件flavor的例子是可以区分组件的“demo”，“paid”和“enterprise”版本，它们都用同样的源码来生成不同功能的二进制文件。

source: An example of such resource is a web container started before an integration test task and which should be always shut down, even if some of the tests fail.
zh_cn: 这样的资源的一个例子是，一个 web 容器会在集成测试任务前开始，并且在之后关闭，即使有些测试失败。

source: An example of this type of changing module is a Maven SNAPSHOT module, which always points at the latest artifact published.
zh_cn: 这种变化模块的类型的一个例子是 MavenSNAPSHOT模块，它总是指向最新发布的构件。

source: An exception is thrown if no tests can be found for a particular subproject.
zh_cn: 如果在一个特定的子项目中，找不到测试用例，那么将会抛出异常。

source: An executable or library can be built to run on different operating systems and cpu architectures, with a variant being produced for each platform.
zh_cn: 通过为每个平台生成一个变种，能够使一个可执行文件或库构建为可以运行在不同的操作系统及CPU架构上。

source: An overview of which Resolvers are offered by Ivy and thus also by Gradle can be found here.
zh_cn: 其中由 Ivy （也因此由 Gradle ）提供解析器的，它的概述可以在这里找到。

source: Analyzes a project hierarchy and stores the results in the Sonar database.
zh_cn: 分析项目层次结构，并将结果存储在 Sonar 数据库。

source: Analyzing a project hierarchy also takes less time than analyzing each project separately.
zh_cn: 分析一个项目的层次结果还可以比单独分析每个项目花费更省时间。

source: And how does this work?
zh_cn: 它是怎么实现的？

source: And not just the jar but also the transitive dependencies of this jar?
zh_cn: 并且，不止是这个jar包，还包括了它的传递依赖？

source: And the Project interface is your starting point for accessing everything in the Gradle API.
zh_cn: 并且Project接口是您在 Gradle API 中访问一切 的入点。

source: And this is actually the case.
zh_cn: 实际上确实是这样子。

source: And we like to offer our users a choice.
zh_cn: 我们想为我们的用户提供一种选择。

source: And where is the build script for the bluewhale project?
zh_cn: 那么，bluewhale项目的构建脚本在哪儿？

source: And you don't gain anything.
zh_cn: 而你不会有其他收获。

source: And you have learned how to create dependencies between tasks.
zh_cn: 并且你已经学会了如何创建任务之间的依赖。

source: And your custom repository is another infrastructure element which might have downtimes and needs to be updated.
zh_cn: 你的自定义存仓库是另一个基础结构元素，它可能有停机时间并且需要更新。

source: Another difference is that always all projects are configured, even when you start the build from a subproject.
zh_cn: 另一个区别是，所有的项目都总是被配置，即使你是从子项目开始构建的。

source: Another source of information you have to lookup.
zh_cn: 你还要查找另外一个信息源。

source: Another typical per-project configuration is the programming language to be analyzed.
zh_cn: 另一种典型的各个项目配置是配置要分析的编程语言。

source: Ant can be divided into two layers.
zh_cn: Ant 可以分为两层。

source: Ant properties and references
zh_cn: Ant 属性和引用

source: Any
zh_cn: 任何

source: Any Sonar properties set on the command line also apply to this project.
zh_cn: 在命令行上设置的任何 Sonar 属性也会应用到这个 project 中。

source: Any log messages which your build classes write using these logging toolkits will be redirected to Gradle's logging system.
zh_cn: 你所构建的类使用这些日志记录工具输出的任何日志消息，都将被重定向到 Gradle 的日志系统。

source: Any method you call in your build script, which is not defined in the build script, is delegated to the Project object.
zh_cn: 在构建脚本中，你所调用的任何一个方法，如果在构建脚本中未定义，它将被委托给Project对象。

source: Any other form of project interaction (i.e. by modifying another project object or by reading a value from another project object) causes the projects to be coupled.
zh_cn: 任何其他形式的项目交互（即通过修改另一个project对象或从另一个项目对象中读取值）将会导致项目的耦合。

source: Any property you access in your build script, which is not defined in the build script, is delegated to the Project object.
zh_cn: 在构建脚本中，你所访问的任何一个属性，如果在构建脚本里未定义，它也会被委托给Project对象。

source: Any task you run in the root project folder will cause that same named task to be run on all the children.
zh_cn: 你在根项目文件夹运行的任何项目，都会导致所有子项目的同名任务被运行。

source: Apart from a status scheme, a module also has a (current) status, which must be one of the values in its status scheme.
zh_cn: 除了状态模式以外，模块也有一个（当前） 的状态，这个状态必须是它的状态模式中的值之一。

source: Apart from source code, the task also analyzes class files and test result files (if available).
zh_cn: 除了源代码之外，该 task 还分析了类文件和测试结果文件（如果有）。

source: Applies maven, java and war plugins (as needed)
zh_cn: 应用maven，java 和 war 插件（如果需要）

source: Applies the Java base plugin.
zh_cn: 适用于 Java 基础插件。

source: Applying a plugin to the project allows the plugin to extend the project's capabilities.
zh_cn: 把插件应用到项目中可以让插件来扩展项目的功能。

source: Applying plugins
zh_cn: 应用插件

source: Applying the plugin adds the buildDashboard task to your project.
zh_cn: 应用该插件将会添加 buildDashboard 任务到你的 project 中。
